АлогистикТест2/src/Documents/алк_СборкаЗапасов/алк_СборкаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_СборкаЗапасов</name>
  <registerRecords>AccumulationRegister.алк_ВыпускПродукцииСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыКПоступлениюНаСкладыСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_МатериалыЗатратыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>AccumulationRegister.алк_УчетЛесопродукцииГОСТ</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиБиржа</registerRecords>
  <registerRecords>InformationRegister.алк_ПакетыИсторияЗаказов</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <registerRecords>AccumulationRegister.алк_Отходы</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыпускОтходы</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПиломатериалыПереданныеНаСушку</registerRecords>
  <registerRecords>InformationRegister.алк_ПараметрыПакетов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаЗапасов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаЗапасов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПродукции</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПродукции</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийСборкаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ПропускатьМинусЗапасы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Автозаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоРазделитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.алк_ЗаказНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.алк_ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоРазделитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаГОСТ</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоГОСТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемГОСТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомераПродукция</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отходы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.Ячейки</types>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/СертификацияПродукции/СертификацияПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СертификацияПродукции</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетовОперативный/алк_ПараметрыПакетовОперативный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетовОперативный</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.алк_ЗаказНаПроизводство</types>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопАналитика</name>
    <type>
      <types>EnumRef.алк_ДопАналитикаПараметрыПакетовОперативный</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <resources>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Актуальность</name>
    <type>
      <types>EnumRef.алк_ОперативнаяАктуальностьПакетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ДополнительныеНастройки/алк_ДополнительныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ДополнительныеНастройки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Строка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_ОперативнаяАктуальностьПакетов/алк_ОперативнаяАктуальностьПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ОперативнаяАктуальностьПакетов</name>
  <enumValues>
    <name>Актуален</name>
  </enumValues>
  <enumValues>
    <name>Изменен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_СборкаЗапасов/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства) Экспорт
	
	Если ДокументСсылкаСборкаЗапасов.ВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Сборка Тогда
		
		ИнициализироватьДанныеДокументаСборка(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства)
		
	Иначе
		
		// ИнициализироватьДанныеДокументаРазборка(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства)
		
	КонецЕсли;	
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ИнициализироватьДанныеДокументаСборка(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	алк_СборкаЗапасовПродукция.НомерСтроки КАК НомерСтроки,
	|	алк_СборкаЗапасовПродукция.Ссылка КАК Ссылка,
	|	алк_СборкаЗапасовПродукция.Ссылка.Дата КАК Период,
	|	алк_СборкаЗапасовПродукция.КлючСвязи КАК КлючСвязи,
	|	алк_СборкаЗапасовПродукция.Номенклатура КАК Номенклатура,
	|	алк_СборкаЗапасовПродукция.Характеристика КАК Характеристика,
	|	алк_СборкаЗапасовПродукция.Количество КАК Количество,
	|	алк_СборкаЗапасовПродукция.ЗаказНаПроизводство.ЗаказПокупателя КАК ЗаказПокупателя,
	|	алк_СборкаЗапасовПродукция.Объем КАК Объем
	|ПОМЕСТИТЬ ВременнаяТаблицаПродукция
	|ИЗ
	|	Документ.алк_СборкаЗапасов.Продукция КАК алк_СборкаЗапасовПродукция
	|ГДЕ
	|	алк_СборкаЗапасовПродукция.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_СборкаЗапасовПродукция.Ссылка КАК Ссылка,
	|	алк_СборкаЗапасовСерийныеНомераПродукция.СерийныйНомер КАК СерийныйНомер,
	|	алк_СборкаЗапасовПродукция.Характеристика КАК Характеристика,
	|	алк_СборкаЗапасовПродукция.Количество КАК КоличествоСостав,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СертификацияПродукцииСрезПоследних.Сертификат, ЗНАЧЕНИЕ(Справочник.СертификатыНаПродукцию.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СертификатыНаПродукцию.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СертификатFSC,
	|	НАЧАЛОПЕРИОДА(алк_СборкаЗапасовПродукция.Ссылка.Дата, ГОД) КАК ПериодПакета,
	|	алк_СборкаЗапасовПродукция.Номенклатура КАК Номенклатура,
	|	алк_СборкаЗапасовПродукция.Ссылка.Дата КАК ПериодУпаковки,
	|	&Период КАК Период
	|ПОМЕСТИТЬ взПараметрыПакетов
	|ИЗ
	|	Документ.алк_СборкаЗапасов.Продукция КАК алк_СборкаЗапасовПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_СборкаЗапасов.СерийныеНомераПродукция КАК алк_СборкаЗапасовСерийныеНомераПродукция
	|		ПО алк_СборкаЗапасовПродукция.КлючСвязи = алк_СборкаЗапасовСерийныеНомераПродукция.КлючСвязи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СертификацияПродукции.СрезПоследних(&Период, ) КАК СертификацияПродукцииСрезПоследних
	|		ПО алк_СборкаЗапасовПродукция.Номенклатура = СертификацияПродукцииСрезПоследних.Номенклатура
	|ГДЕ
	|	алк_СборкаЗапасовПродукция.Ссылка = &Ссылка
	|	И алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.Сертификат КАК Сертификат,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.Габарит КАК Габарит,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.КатегорияНоменклатурыПЭО КАК КатегорияНоменклатурыПЭО,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.Объем КАК Объем,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.ОбъемТаможня КАК ОбъемТаможня,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.ВесНеттоТаможня КАК ВесНеттоТаможня,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.ВесБруттоТаможня КАК ВесБруттоТаможня,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.Припуск КАК Припуск,
	|	взПараметрыПакетов.Ссылка КАК Ссылка,
	|	взПараметрыПакетов.СерийныйНомер КАК СерийныйНомер,
	|	взПараметрыПакетов.Характеристика КАК Характеристика,
	|	взПараметрыПакетов.КоличествоСостав КАК КоличествоСостав,
	|	взПараметрыПакетов.ПериодПакета КАК ПериодПакета,
	|	взПараметрыПакетов.Номенклатура КАК Номенклатура,
	|	взПараметрыПакетов.ПериодУпаковки КАК ПериодУпаковки,
	|	взПараметрыПакетов.Период КАК Период,
	|	ВЫБОР
	|		КОГДА &ПоОперативномуРегистру
	|			ТОГДА алк_ПараметрыПакетовОперативныйСрезПоследних.СертификатFSC
	|		ИНАЧЕ взПараметрыПакетов.СертификатFSC
	|	КОНЕЦ КАК СертификатFSC,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.ПризнакНЗП
	|ИЗ
	|	взПараметрыПакетов КАК взПараметрыПакетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних(
	|				,
	|				Актуальность = ЗНАЧЕНИЕ(Перечисление.алк_ОперативнаяАктуальностьПакетов.Актуален)
	|					И СерийныйНомер В
	|						(ВЫБРАТЬ
	|							взПараметрыПакетов.СерийныйНомер
	|						ИЗ
	|							взПараметрыПакетов)) КАК алк_ПараметрыПакетовОперативныйСрезПоследних
	|		ПО взПараметрыПакетов.СерийныйНомер = алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_СборкаЗапасовПродукция.Ссылка КАК Ссылка,
	|	алк_СборкаЗапасовСерийныеНомераПродукция.СерийныйНомер КАК СерийныйНомер,
	|	алк_СборкаЗапасовПродукция.Ссылка.Организация КАК Организация,
	|	алк_СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиницаПродукции КАК СтруктурнаяЕдиница,
	|	алк_СборкаЗапасовПродукция.Ссылка.ЯчейкаПродукции КАК Ячейка,
	|	1 КАК КоличествоПакетов,
	|	&ВидДвиженияНакопления КАК ВидДвижения,
	|	&Период КАК Период,
	|	алк_СборкаЗапасовПродукция.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.алк_СборкаЗапасов.Продукция КАК алк_СборкаЗапасовПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_СборкаЗапасов.СерийныеНомераПродукция КАК алк_СборкаЗапасовСерийныеНомераПродукция
	|		ПО алк_СборкаЗапасовПродукция.КлючСвязи = алк_СборкаЗапасовСерийныеНомераПродукция.КлючСвязи
	|ГДЕ
	|	алк_СборкаЗапасовПродукция.Ссылка = &Ссылка
	|	И алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка = &Ссылка
	|	И алк_СборкаЗапасовПродукция.Номенклатура.КатегорияНоменклатуры В(&КатегорииДляСклада)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПродукция.Период,
	|	ТаблицаПродукция.Период КАК ДатаСобытия,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Приход) КАК Операция,
	|	ТаблицаПродукция.Номенклатура,
	|	ТаблицаПродукция.Характеристика,
	|	алк_СборкаЗапасовСерийныеНомераПродукция.СерийныйНомер
	|ИЗ
	|	ВременнаяТаблицаПродукция КАК ТаблицаПродукция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.алк_СборкаЗапасов.СерийныеНомераПродукция КАК алк_СборкаЗапасовСерийныеНомераПродукция
	|		ПО ТаблицаПродукция.Ссылка = алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка
	|			И ТаблицаПродукция.КлючСвязи = алк_СборкаЗапасовСерийныеНомераПродукция.КлючСвязи
	|ГДЕ
	|	алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_СборкаЗапасовЗапасы.Номенклатура,
	|	алк_СборкаЗапасовЗапасы.Характеристика,
	|	алк_СборкаЗапасовЗапасы.Количество,
	|	алк_СборкаЗапасовЗапасы.Объем,
	|	алк_СборкаЗапасовЗапасы.Ссылка.Дата КАК Период
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.алк_СборкаЗапасов.Запасы КАК алк_СборкаЗапасовЗапасы
	|ГДЕ
	|	алк_СборкаЗапасовЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Количество,
	|	ТаблицаЗапасы.Объем,
	|	ТаблицаЗапасы.Период
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаПродукция.Номенклатура,
	|	ВременнаяТаблицаПродукция.Характеристика,
	|	ВременнаяТаблицаПродукция.Период,
	|	&ВидДвиженияНакопления КАК ВидДвижения,
	|	ВременнаяТаблицаПродукция.Количество,
	|	ВременнаяТаблицаПродукция.Ссылка.Организация КАК Организация,
	|	ВременнаяТаблицаПродукция.Ссылка.ДатаСмены КАК ДатаСмены,
	|	ВременнаяТаблицаПродукция.Ссылка.Смена КАК Смена,
	|	ВременнаяТаблицаПродукция.Объем КАК Объем
	|ИЗ
	|	ВременнаяТаблицаПродукция КАК ВременнаяТаблицаПродукция
	|ГДЕ
	|	ВременнаяТаблицаПродукция.КлючСвязи = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_СборкаЗапасовСерийныеНомераПродукция.СерийныйНомер,
	|	ВременнаяТаблицаПродукция.Период,
	|	ВременнаяТаблицаПродукция.ЗаказПокупателя
	|ИЗ
	|	ВременнаяТаблицаПродукция КАК ВременнаяТаблицаПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_СборкаЗапасов.СерийныеНомераПродукция КАК алк_СборкаЗапасовСерийныеНомераПродукция
	|		ПО ВременнаяТаблицаПродукция.КлючСвязи = алк_СборкаЗапасовСерийныеНомераПродукция.КлючСвязи
	|ГДЕ
	|	алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка = &Ссылка
	|	И ВременнаяТаблицаПродукция.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.алк_ЗаказПокупателя.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСборкаЗапасов);
	Запрос.УстановитьПараметр("Период", ДокументСсылкаСборкаЗапасов.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияНакопления", ВидДвиженияНакопления.Приход);
	
	МассивКатегорий = Новый Массив;
	МассивКатегорий.Добавить(Справочники.КатегорииНоменклатуры.Карандаши);
	МассивКатегорий.Добавить(Справочники.КатегорииНоменклатуры.ШпонКусковой);
	МассивКатегорий.Добавить(Справочники.КатегорииНоменклатуры.Пиломатериал);
	МассивКатегорий.Добавить(Справочники.КатегорииНоменклатуры.НайтиПоКоду("ПБ-000005")); //Чурак оцилиндрованный (кат)
	МассивКатегорий.Добавить(Справочники.КатегорииНоменклатуры.НайтиПоКоду("ПБ-000006")); //Побочная продукция (кат)
	МассивКатегорий.Добавить(Справочники.КатегорииНоменклатуры.НайтиПоКоду("ПБ-000007")); //Пилеты (кат)
	
	ЗапросДата = Новый Запрос;
	ЗапросДата.Текст = 
		"ВЫБРАТЬ
		|	алк_ДополнительныеНастройкиСрезПоследних.Дата
		|ИЗ
		|	РегистрСведений.алк_ДополнительныеНастройки.СрезПоследних(, Параметр = ""Начало учета СП на Запасак к поступлению"") КАК алк_ДополнительныеНастройкиСрезПоследних";
	
	РезультатЗапроса = ЗапросДата.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Дата <= ДокументСсылкаСборкаЗапасов.Дата Тогда
			МассивКатегорий.Добавить(Справочники.КатегорииНоменклатуры.ПиломатериалСП);		
		КонецЕсли;                                                                     	
	КонецЦикла;
		
	Запрос.УстановитьПараметр("КатегорииДляСклада", МассивКатегорий);
	
	Запрос.УстановитьПараметр("ПоОперативномуРегистру", ДокументСсылкаСборкаЗапасов.Автозаполнение);

	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТабЗапроса = МассивРезультатов[2].Выгрузить();
	ТабЗапроса.Колонки.Добавить("НомерПакета", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(6,0, ДопустимыйЗнак.Неотрицательный)));
	
	//добавляем колонку документ для доп параметры пакетов
	ТабЗапроса.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.алк_СборкаЗапасов"));
	//\\
	
	Для каждого стрТаб Из ТабЗапроса Цикл
		стрТаб.НомерПакета = НоменклатураСервер.НомерСерии(стрТаб.СерийныйНомер);
		стрТаб.Документ = ДокументСсылкаСборкаЗапасов; 
	КонецЦикла; 
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыПакетов", ТабЗапроса);
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыКПоступлениюНаСкладыСерии", МассивРезультатов[3].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаМатериалыЗатратыВыпуска", МассивРезультатов[6].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыпускПродукции", МассивРезультатов[7].Выгрузить()); 
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДополнительныеПараметрыПакетов", ТабЗапроса);
	
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПакетыИсторияЗаказов", МассивРезультатов[1].Выгрузить());
	
	// Серийные номера
	РезультатЗапроса8 = МассивРезультатов[4].Выгрузить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", РезультатЗапроса8);
	Если СтруктураДополнительныеСвойства.УчетнаяПолитика.ОстаткиСерийныхНомеров Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераОстатки", РезультатЗапроса8);
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераОстатки", Новый ТаблицаЗначений);
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПакетыИсторияЗаказов", МассивРезультатов[8].Выгрузить());
	
	
	СформироватьТаблицаЗапасыОрганизации(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВыпускОтходы(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства);
	
	//Сергеева Г.О. ОборотыПроизводства ++
	СформироватьТаблицуОборотыПроизводства(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства);
	//Сергеева Г.О. ОборотыПроизводства -- 
	
	//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
	Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(ДокументСсылкаСборкаЗапасов.Дата) Тогда
		СформироватьТаблицуПроизводствоОборот(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства);
		СформироватьТаблицуОстаткиЗапасов(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства);
	КонецЕсли;
	//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов --
	
	// минусанем РН алк_Отходы - это расход щепы на производство кускового шпона и карандашей
	Если ДокументСсылкаСборкаЗапасов.Направление = Перечисления.алк_НаправленияДеятельности.Отходы Тогда
		
		СформироватьТаблицаОтходы(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства);
		
	КонецЕсли; 
	
	СформироватьТаблицаДокументыПослБиржа(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаПиломатериалыПереданныеНаСушку(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства);
	//СформироватьТаблицаОстаткиНезавершенногоПроизводства(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства);
	
КонецПроцедуры


#Область Проведение

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаОтходы(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_СборкаЗапасовПродукция.Номенклатура,
	|	алк_СборкаЗапасовПродукция.Характеристика,
	|	алк_СборкаЗапасовСерийныеНомераПродукция.СерийныйНомер,
	|	алк_СборкаЗапасовПродукция.Ссылка.Организация,
	|	алк_СборкаЗапасовПродукция.Ссылка.ДатаСмены,
	|	алк_СборкаЗапасовПродукция.Ссылка.Смена,
	|	алк_СборкаЗапасовПродукция.ЗаказНаПроизводство.ДокументОснование КАК ЗаказПокупателя,
	|	1 КАК КоличествоПакетов,
	|	&Период,
	|	&ВидДвижения,
	|	алк_СборкаЗапасовПродукция.Количество КАК КоличествоСостав,
	|	&Аналитика,
	|	ВЫБОР
	|		КОГДА алк_СборкаЗапасовПродукция.Номенклатура = &ШпонКусковой
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.алк_АналитикаОборотаОтходов.ШпонКусковой)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА алк_СборкаЗапасовПродукция.Номенклатура = &Карандаши
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.алк_АналитикаОборотаОтходов.Карандаши)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.алк_АналитикаОборотаОтходов.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК ДополнительнаяАналитика,
	|	алк_СборкаЗапасовПродукция.Сертификат,
	|	алк_СборкаЗапасовПродукция.Ссылка.СертификатFSC
	|ИЗ
	|	Документ.алк_СборкаЗапасов.Продукция КАК алк_СборкаЗапасовПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_СборкаЗапасов.СерийныеНомераПродукция КАК алк_СборкаЗапасовСерийныеНомераПродукция
	|		ПО алк_СборкаЗапасовПродукция.КлючСвязи = алк_СборкаЗапасовСерийныеНомераПродукция.КлючСвязи
	|ГДЕ
	|	алк_СборкаЗапасовПродукция.Ссылка = &Ссылка
	|	И алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Период", ДокументСсылкаСборкаЗапасов.Дата);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСборкаЗапасов);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Аналитика", Перечисления.алк_АналитикаЩепа.НаПроизводствоВозвратных);
	Запрос.УстановитьПараметр("ШпонКусковой", РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.ШпонКусковой)); 
	Запрос.УстановитьПараметр("Карандаши", РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Карандаши)); 
	
	РезултатЗапроса = Запрос.Выполнить();
	
	ТаблицаПараметрыПакетов = РезултатЗапроса.Выгрузить();
	
	ТаблицаПараметрыПакетов.Колонки.Добавить("Объем", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	//ТаблицаПараметрыПакетов.Колонки.Добавить("ОбъемТаможня", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	//ТаблицаПараметрыПакетов.Колонки.Добавить("ВесНеттоТаможня", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	//ТаблицаПараметрыПакетов.Колонки.Добавить("ВесБруттоТаможня", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	//ТаблицаПараметрыПакетов.Колонки.Добавить("БоковаяДоска", Новый ОписаниеТипов("Булево"));
	
	Щепа = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Щепа);
	
	Для каждого стрПакет Из ТаблицаПараметрыПакетов Цикл
		
		РассчетныеПараметры = РфпСервер.ЗаполнитьСтруктуруПараметровПакета(стрПакет, ДокументСсылкаСборкаЗапасов.Дата);
		
		ЗаполнитьЗначенияСвойств(стрПакет, РассчетныеПараметры);
		
		стрПакет.Номенклатура = Щепа;
		стрПакет.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		
	КонецЦикла;
	
	ТаблицаПараметрыПакетов.Свернуть("Сертификат, СертификатFSC, Номенклатура, Характеристика, ДатаСмены, Смена, Аналитика, Период, ВидДвижения, ДополнительнаяАналитика", "Объем"); 
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтходы", ТаблицаПараметрыПакетов);
	
КонецПроцедуры 

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыОрганизации(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Продукция.Организация,
	|	Продукция.СтруктурнаяЕдиницаПродукции,
	|	Продукция.Номенклатура,
	|	Продукция.Характеристика,
	|	Продукция.Количество,
	|	ВЫБОР
	|		КОГДА ПродукцияСерийныеНомера.Направление = &НаправлениеДГ
	|			ТОГДА Продукция.Количество / 1000
	|		ИНАЧЕ Продукция.Объем
	|	КОНЕЦ КАК Объем,
	|	Продукция.ВидДвиженияНакопленияПриход,
	|	Продукция.Период,
	|	Продукция.ЯчейкаПродукции,
	|	Продукция.ДатаСмены,
	|	Продукция.Смена,
	|	Продукция.Операция,
	|	ЕСТЬNULL(ПродукцияСерийныеНомера.КлючСвязи, 0) КАК КлючСвязи,
	|	Продукция.СертификатFSC,
	|	Продукция.Сертификат,
	|	Продукция.Влажность,
	|	ПродукцияСерийныеНомера.Направление
	|ПОМЕСТИТЬ втПродукция
	|ИЗ
	|	(ВЫБРАТЬ
	|		алк_СборкаЗапасовПродукция.Ссылка.Организация КАК Организация,
	|		алк_СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиницаПродукции КАК СтруктурнаяЕдиницаПродукции,
	|		алк_СборкаЗапасовПродукция.Номенклатура КАК Номенклатура,
	|		алк_СборкаЗапасовПродукция.Характеристика КАК Характеристика,
	|		алк_СборкаЗапасовПродукция.Количество КАК Количество,
	|		ВЫБОР
	|			КОГДА алк_СборкаЗапасовПродукция.Объем = 0
	|				ТОГДА алк_СборкаЗапасовПродукция.Количество * (алк_ПараметрыХарактеристик.Длина.ДлинаММ * алк_ПараметрыХарактеристик.Сечение.ШиринаММ * алк_ПараметрыХарактеристик.Сечение.ТолщинаММ) / 1000000000
	|			ИНАЧЕ алк_СборкаЗапасовПродукция.Объем
	|		КОНЕЦ КАК Объем,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвиженияНакопленияПриход,
	|		&Период КАК Период,
	|		алк_СборкаЗапасовПродукция.Ссылка.ЯчейкаПродукции КАК ЯчейкаПродукции,
	|		алк_СборкаЗапасовПродукция.Ссылка.ДатаСмены КАК ДатаСмены,
	|		алк_СборкаЗапасовПродукция.Ссылка.Смена КАК Смена,
	|		"""" КАК Операция,
	|		алк_СборкаЗапасовПродукция.КлючСвязи КАК КлючСвязи,
	|		алк_СборкаЗапасовПродукция.Ссылка.СертификатFSC КАК СертификатFSC,
	|		алк_СборкаЗапасовПродукция.Сертификат КАК Сертификат,
	|		алк_ПараметрыХарактеристик.Влажность КАК Влажность
	|	ИЗ
	|		Документ.алк_СборкаЗапасов.Продукция КАК алк_СборкаЗапасовПродукция
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|			ПО алк_СборкаЗапасовПродукция.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|	ГДЕ
	|		алк_СборкаЗапасовПродукция.Ссылка = &Ссылка
	|		И НЕ алк_СборкаЗапасовПродукция.СерийныеНомера ПОДОБНО ""НЗ%"") КАК Продукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			алк_СборкаЗапасовСерийныеНомераПродукция.КлючСвязи КАК КлючСвязи,
	|			алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка.Направление КАК Направление
	|		ИЗ
	|			Документ.алк_СборкаЗапасов.СерийныеНомераПродукция КАК алк_СборкаЗапасовСерийныеНомераПродукция
	|		ГДЕ
	|			алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка = &Ссылка) КАК ПродукцияСерийныеНомера
	|		ПО Продукция.КлючСвязи = ПродукцияСерийныеНомера.КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_СборкаЗапасовЗапасы.Ссылка.Организация,
	|	алк_СборкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаЗапасов КАК СтруктурнаяЕдиница,
	|	алк_СборкаЗапасовЗапасы.Номенклатура,
	|	алк_СборкаЗапасовЗапасы.Характеристика,
	|	алк_СборкаЗапасовЗапасы.Количество,
	|	ВЫБОР
	|		КОГДА алк_СборкаЗапасовЗапасы.Ссылка.Направление = &НаправлениеДГ
	|			ТОГДА алк_СборкаЗапасовЗапасы.Количество / 1000
	|		ИНАЧЕ алк_СборкаЗапасовЗапасы.Объем
	|	КОНЕЦ КАК Объем,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период,
	|	алк_СборкаЗапасовЗапасы.Ссылка.ЯчейкаЗапасов КАК Ячейка,
	|	алк_СборкаЗапасовЗапасы.Ссылка.ДатаСмены,
	|	алк_СборкаЗапасовЗапасы.Ссылка.Смена,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаПроизводство) КАК Операция,
	|	0 КАК КлючСвязи,
	|	алк_СборкаЗапасовЗапасы.Ссылка.СертификатFSC,
	|	алк_СборкаЗапасовЗапасы.Сертификат КАК Сертификат,
	|	"""" КАК Влажность,
	|	алк_СборкаЗапасовЗапасы.Ссылка.Направление
	|ИЗ
	|	Документ.алк_СборкаЗапасов.Запасы КАК алк_СборкаЗапасовЗапасы
	|ГДЕ
	|	алк_СборкаЗапасовЗапасы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втПродукция.Организация,
	|	втПродукция.СтруктурнаяЕдиницаПродукции,
	|	втПродукция.Номенклатура,
	|	втПродукция.Характеристика,
	|	втПродукция.Количество,
	|	втПродукция.Объем,
	|	втПродукция.ВидДвиженияНакопленияПриход,
	|	втПродукция.Период,
	|	втПродукция.ЯчейкаПродукции,
	|	втПродукция.ДатаСмены,
	|	втПродукция.Смена,
	|	втПродукция.Операция,
	|	втПродукция.КлючСвязи,
	|	втПродукция.СертификатFSC,
	|	втПродукция.Сертификат,
	|	втПродукция.Влажность,
	|	втПродукция.Направление
	|ИЗ
	|	втПродукция КАК втПродукция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_СборкаЗапасовЗапасы.Ссылка.Организация,
	|	алк_СборкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаЗапасов КАК СтруктурнаяЕдиница,
	|	алк_СборкаЗапасовЗапасы.Номенклатура,
	|	алк_СборкаЗапасовЗапасы.Характеристика,
	|	алк_СборкаЗапасовЗапасы.Количество,
	|	ВЫБОР
	|		КОГДА алк_СборкаЗапасовЗапасы.Ссылка.Направление = &НаправлениеДГ
	|			ТОГДА алк_СборкаЗапасовЗапасы.Количество / 1000
	|		ИНАЧЕ алк_СборкаЗапасовЗапасы.Объем
	|	КОНЕЦ КАК Объем,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период,
	|	алк_СборкаЗапасовЗапасы.Ссылка.ЯчейкаЗапасов КАК Штабель,
	|	алк_СборкаЗапасовЗапасы.Ссылка.СертификатFSC,
	|	алк_СборкаЗапасовЗапасы.Сертификат КАК Сертификат,
	|	NULL КАК Влажность,
	|	алк_СборкаЗапасовЗапасы.Ссылка.Направление
	|ИЗ
	|	Документ.алк_СборкаЗапасов.Запасы КАК алк_СборкаЗапасовЗапасы
	|ГДЕ
	|	алк_СборкаЗапасовЗапасы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втПродукция.Организация,
	|	втПродукция.СтруктурнаяЕдиницаПродукции,
	|	втПродукция.Номенклатура,
	|	втПродукция.Характеристика,
	|	втПродукция.Количество,
	|	втПродукция.Объем,
	|	втПродукция.ВидДвиженияНакопленияПриход,
	|	втПродукция.Период,
	|	втПродукция.ЯчейкаПродукции,
	|	втПродукция.СертификатFSC,
	|	втПродукция.Сертификат,
	|	втПродукция.Влажность,
	|	втПродукция.Направление
	|ИЗ
	|	втПродукция КАК втПродукция";
			
	Запрос.УстановитьПараметр("Период", ДокументСсылкаСборкаЗапасов.Дата);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСборкаЗапасов);
	Запрос.УстановитьПараметр("НаправлениеДГ", Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// если автозаполнение то формируем приход на ЦЛП, тут же списание с ЦЛП, чтобы показать обороты 
	// а после формируем приход на СГП 
	//за ИСКЛЮЧЕНИЕМ пакетов незавершенного производства
	
	// если это номенклатура Пиломатериал (СП) "ПБ-00000012" - это сушильный пакет, 
	// его отправляем на склад - Сушильный комплекс "ПБ-000031"
	
	ПиломатериалСП = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000012");
	СушильныйКомплекс = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000031");
	СГП = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	КД_12 = Справочники.Влажность.НайтиПоКоду("000000002");
	КД_18 = Справочники.Влажность.НайтиПоКоду("000000003");
	
	
	Если ДокументСсылкаСборкаЗапасов.Автозаполнение Тогда
		
		ТЗ_0 = МассивРезультатов[1].Выгрузить();
		
		ТЗ = ТЗ_0.Скопировать();
		ТЗ.Очистить();
		
		ТЗ_1 = МассивРезультатов[2].Выгрузить();
		ТЗ1 = ТЗ_1.Скопировать();
		ТЗ1.Очистить();
		
		Для каждого Стр Из ТЗ_0 Цикл
			
			Если НЕ (Стр.Влажность = КД_12 Или Стр.Влажность = КД_18) Тогда
				// приход ЦЛП 
				НоваяСтр = ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);  		
			КонецЕсли; 
						
			// расход ЦЛП			
			НоваяСтр = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтр, Стр); 			
			НоваяСтр.ВидДвижения = ВидДвиженияНакопления.Расход;
			
			Если Стр.Номенклатура = ПиломатериалСП Тогда 				
				// приход Сушильный комплекс 
				НоваяСтр = ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);
				НоваяСтр.СтруктурнаяЕдиница = СушильныйКомплекс; 				
			Иначе                                                				
				// приход СГП 
				НоваяСтр = ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);
				НоваяСтр.СтруктурнаяЕдиница = СГП;            				
			КонецЕсли;                		
			
		КонецЦикла; 
		
		Для каждого Стр Из ТЗ_1 Цикл
			
			Если НЕ (Стр.Влажность = КД_12 Или Стр.Влажность = КД_18) Тогда
				// приход ЦЛП 
				НоваяСтр = ТЗ1.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);  		
			КонецЕсли; 
						
			// расход ЦЛП			
			НоваяСтр = ТЗ1.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтр, Стр); 			
			НоваяСтр.ВидДвижения = ВидДвиженияНакопления.Расход;
			
			Если Стр.Номенклатура = ПиломатериалСП Тогда 				
				// приход Сушильный комплекс 
				НоваяСтр = ТЗ1.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);
				НоваяСтр.СтруктурнаяЕдиница = СушильныйКомплекс; 				
			Иначе                                                				
				// приход СГП 
				НоваяСтр = ТЗ1.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);
				НоваяСтр.СтруктурнаяЕдиница = СГП;            				
			КонецЕсли;                		
			
		КонецЦикла; 

	Иначе
		
		ТЗ = МассивРезультатов[1].Выгрузить();
		ТЗ1 = МассивРезультатов[2].Выгрузить();
	КонецЕсли; 
	
				
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", ТЗ);
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЛесопродукции", ТЗ1);

	
КонецПроцедуры // СформироватьТаблицаЗапасыОрганизации

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВыпускОтходы(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства)
	
	
	СтруктурнаяЕдиница = ДокументСсылкаСборкаЗапасов.Организация.ДополнительныеРеквизиты.Найти(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Буферный склад"),"Свойство").Значение; 
			
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_СборкаЗапасовОтходы.Ссылка.Организация,
	|	алк_СборкаЗапасовОтходы.Номенклатура,
	|	алк_СборкаЗапасовОтходы.Характеристика,
	|	алк_СборкаЗапасовОтходы.Объем,
	|	&Период,
	|	алк_СборкаЗапасовОтходы.Ссылка.ДатаСмены,
	|	алк_СборкаЗапасовОтходы.Ссылка.Смена,
	|	алк_СборкаЗапасовОтходы.Сертификат,
	|	алк_СборкаЗапасовОтходы.Ссылка.СертификатFSC,
	|	алк_СборкаЗапасовОтходы.Ячейка,
	|	ВЫБОР
	|		КОГДА алк_СборкаЗапасовОтходы.Ссылка.Направление = ЗНАЧЕНИЕ(Перечисление.алк_НаправленияДеятельности.Лесопиление)
	|			ТОГДА &СтруктурнаяЕдиница
	|		ИНАЧЕ алк_СборкаЗапасовОтходы.Ссылка.СтруктурнаяЕдиницаПродукции
	|	КОНЕЦ КАК СтруктурнаяЕдиница
	|ИЗ
	|	Документ.алк_СборкаЗапасов.Отходы КАК алк_СборкаЗапасовОтходы
	|ГДЕ
	|	алк_СборкаЗапасовОтходы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Период", ДокументСсылкаСборкаЗапасов.Дата);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСборкаЗапасов);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыпускОтходы", МассивРезультатов[0].Выгрузить());
	
	
КонецПроцедуры // СформироватьТаблицаЗапасыОрганизации

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДокументыПослБиржа(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойОтветственный");
	ОсновнойОтветственный = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.Сотрудники.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("Сотрудник", ОсновнойОтветственный);
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_СборкаЗапасов.Ссылка.Организация КАК Организация,
	|	&Период,
	|	алк_СборкаЗапасов.Ссылка.ДатаСмены КАК ДатаСмены,
	|	алк_СборкаЗапасов.Ссылка.Смена КАК Смена,
	|	0 КАК МоментПроведения,
	|	&Сотрудник
	|ИЗ
	|	Документ.алк_СборкаЗапасов КАК алк_СборкаЗапасов
	|ГДЕ
	|	алк_СборкаЗапасов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Период", ДокументСсылкаСборкаЗапасов.Дата);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСборкаЗапасов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	тРезультат = МассивРезультатов[0].Выгрузить();
	
	Для каждого стр Из тРезультат Цикл
		
		стр.МоментПроведения = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
	КонецЦикла; 
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДокументыПослБиржа", тРезультат);
	
КонецПроцедуры // СформироватьТаблицаДокументыПослБиржа
	
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПиломатериалыПереданныеНаСушку(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства)
	
	/////////////////// !!!!!!!!!!!!!!! ///////////////// 
	Возврат;                                             
	/////////////////// !!!!!!!!!!!!!!! /////////////////
	
	ЗначенияРеквизитовСборкаЗапасов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДополнительныеСвойства.ДляПроведения.Ссылка, "Смена, ДатаСмены, Дата");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ДатаДокумента КАК Период,
	|	&ВидДвижения КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	&СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	алк_ПараметрыПакетовОперативный.СерийныйНомер,
	|	алк_ПараметрыПакетовОперативный.Характеристика,
	|	ВЫРАЗИТЬ(алк_ПараметрыПакетовОперативный.Характеристика.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
	|	алк_ПараметрыПакетовОперативный.Сертификат,
	|	алк_ПараметрыПакетовОперативный.КоличествоСостав КАК Количество,
	|	алк_ПараметрыПакетовОперативный.Объем
	|ИЗ
	|	РегистрСведений.алк_ПараметрыПакетовОперативный КАК алк_ПараметрыПакетовОперативный
	|ГДЕ
	|	алк_ПараметрыПакетовОперативный.Смена = &Смена
	|	И алк_ПараметрыПакетовОперативный.ДатаСмены = &ДатаСмены
	|	И алк_ПараметрыПакетовОперативный.СерийныйНомер.Наименование ПОДОБНО ""СП%""
	|	И алк_ПараметрыПакетовОперативный.Актуальность = ЗНАЧЕНИЕ(Перечисление.алк_ОперативнаяАктуальностьПакетов.Актуален)";	
	
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
	Запрос.УстановитьПараметр("Смена", ЗначенияРеквизитовСборкаЗапасов.Смена);
	Запрос.УстановитьПараметр("ДатаСмены", ЗначенияРеквизитовСборкаЗапасов.ДатаСмены);
	Запрос.УстановитьПараметр("ДатаДокумента", ЗначенияРеквизитовСборкаЗапасов.Дата);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("алк_ПиломатериалыПереданныеНаСушку", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаОстаткиНезавершенногоПроизводства(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства)
	
	ЗначенияРеквизитовСборкаЗапасов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДополнительныеСвойства.ДляПроведения.Ссылка, "Смена, ДатаСмены, Дата, СтруктурнаяЕдиницаПродукции");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ДатаДокумента КАК Период,
	|	&ВидДвижения КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	&СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	алк_ПараметрыПакетовОперативный.СерийныйНомер,
	|	алк_ПараметрыПакетовОперативный.Характеристика,
	|	ВЫРАЗИТЬ(алк_ПараметрыПакетовОперативный.Характеристика.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
	|	алк_ПараметрыПакетовОперативный.Сертификат,
	|	алк_ПараметрыПакетовОперативный.КоличествоСостав КАК Количество,
	|	алк_ПараметрыПакетовОперативный.Объем
	|ИЗ
	|	РегистрСведений.алк_ПараметрыПакетовОперативный КАК алк_ПараметрыПакетовОперативный
	|ГДЕ
	|	алк_ПараметрыПакетовОперативный.Смена = &Смена
	|	И алк_ПараметрыПакетовОперативный.ДатаСмены = &ДатаСмены
	|	И алк_ПараметрыПакетовОперативный.СерийныйНомер.Наименование ПОДОБНО ""НЗ%""
	|	И алк_ПараметрыПакетовОперативный.Актуальность = ЗНАЧЕНИЕ(Перечисление.алк_ОперативнаяАктуальностьПакетов.Актуален)";	
	
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ЗначенияРеквизитовСборкаЗапасов.СтруктурнаяЕдиницаПродукции);
	Запрос.УстановитьПараметр("Смена", ЗначенияРеквизитовСборкаЗапасов.Смена);
	Запрос.УстановитьПараметр("ДатаСмены", ЗначенияРеквизитовСборкаЗапасов.ДатаСмены);
	Запрос.УстановитьПараметр("ДатаДокумента", ЗначенияРеквизитовСборкаЗапасов.Дата);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиНезавершенногоПроизводства", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

//Формирует таблицу значений, для отражения оборотов производства Сергеева Г.О.
Процедура СформироватьТаблицуОборотыПроизводства(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_СборкаЗапасовПродукция.Номенклатура,
		|	алк_СборкаЗапасовПродукция.Характеристика,
		|	СУММА(ВЫБОР
		|			КОГДА алк_СборкаЗапасовПродукция.Ссылка.Направление = &НаправлениеДГ
		|				ТОГДА алк_СборкаЗапасовПродукция.Количество / 1000
		|			ИНАЧЕ алк_СборкаЗапасовПродукция.Объем
		|		КОНЕЦ) КАК Объем,
		|	алк_СборкаЗапасовПродукция.Ссылка.Организация,
		|	NULL КАК Штабель,
		|	ВЫБОР
		|		КОГДА алк_СборкаЗапасовПродукция.Ссылка.Направление = &НаправлениеДГ
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Упаковано)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Произведено)
		|	КОНЕЦ КАК Операция,
		|	алк_СборкаЗапасовПродукция.Ссылка.Дата КАК Период,
		|	алк_СборкаЗапасовПродукция.СерийныеНомера = """" КАК ВнутреннееПотребление,
		|	алк_СборкаЗапасовПродукция.Ссылка.Направление
		|ИЗ
		|	Документ.алк_СборкаЗапасов.Продукция КАК алк_СборкаЗапасовПродукция
		|ГДЕ
		|	алк_СборкаЗапасовПродукция.Ссылка.Ссылка = &ДокументСсылкаСборкаЗапасов
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_СборкаЗапасовПродукция.Номенклатура,
		|	алк_СборкаЗапасовПродукция.Характеристика,
		|	алк_СборкаЗапасовПродукция.Ссылка.Организация,                                                       
		|	алк_СборкаЗапасовПродукция.Ссылка.Дата,
		|	алк_СборкаЗапасовПродукция.Ссылка.Направление,
		|	алк_СборкаЗапасовПродукция.СерийныеНомера = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_СборкаЗапасовПродукция.Номенклатура,
		|	алк_СборкаЗапасовПродукция.Характеристика,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_СборкаЗапасовПродукция.СерийныеНомера),
		|	алк_СборкаЗапасовПродукция.Ссылка.Организация,
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.УпакованоШтук),
		|	алк_СборкаЗапасовПродукция.Ссылка.Дата,
		|	алк_СборкаЗапасовПродукция.СерийныеНомера = """",
		|	алк_СборкаЗапасовПродукция.Ссылка.Направление
		|ИЗ
		|	Документ.алк_СборкаЗапасов.Продукция КАК алк_СборкаЗапасовПродукция
		|ГДЕ
		|	алк_СборкаЗапасовПродукция.Ссылка.Ссылка = &ДокументСсылкаСборкаЗапасов
		|	И алк_СборкаЗапасовПродукция.Ссылка.Направление = &НаправлениеДГ
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_СборкаЗапасовПродукция.Ссылка.Организация,
		|	алк_СборкаЗапасовПродукция.Ссылка.Дата,
		|	алк_СборкаЗапасовПродукция.Ссылка.Направление,
		|	алк_СборкаЗапасовПродукция.Номенклатура,
		|	алк_СборкаЗапасовПродукция.Характеристика,
		|	алк_СборкаЗапасовПродукция.СерийныеНомера = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_СборкаЗапасовОтходы.Номенклатура,
		|	алк_СборкаЗапасовОтходы.Характеристика,
		|	алк_СборкаЗапасовОтходы.Объем,
		|	алк_СборкаЗапасовОтходы.Ссылка.Организация,
		|	алк_СборкаЗапасовОтходы.Ячейка,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Произведено),
		|	алк_СборкаЗапасовОтходы.Ссылка.Дата,
		|	ЛОЖЬ,
		|	алк_СборкаЗапасовОтходы.Ссылка.Направление
		|ИЗ
		|	Документ.алк_СборкаЗапасов.Отходы КАК алк_СборкаЗапасовОтходы
		|ГДЕ
		|	алк_СборкаЗапасовОтходы.Ссылка = &ДокументСсылкаСборкаЗапасов";
	
	Запрос.УстановитьПараметр("ДокументСсылкаСборкаЗапасов", ДокументСсылкаСборкаЗапасов);
	Запрос.УстановитьПараметр("НаправлениеДГ", Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы);
	ТЗ = Запрос.Выполнить().Выгрузить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОборотыПроизводства", ТЗ);

КонецПроцедуры

Процедура СформироватьТаблицуПроизводствоОборот(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_СборкаЗапасовПродукция.Ссылка КАК Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано) КАК ВидДвиженияПроизводства,
	|	алк_СборкаЗапасовПродукция.Номенклатура КАК Номенклатура,
	|	алк_СборкаЗапасовСерийныеНомераПродукция.СерийныйНомер КАК СерийныйНомер,
	|	алк_СборкаЗапасовПродукция.Сертификат КАК Сертификат,
	|	алк_СборкаЗапасовПродукция.Характеристика КАК Характеристика,
	|	алк_СборкаЗапасовПродукция.Количество КАК Количество,
	|	алк_СборкаЗапасовПродукция.Объем КАК Объем,
	|	ВЫБОР
	|		КОГДА алк_СборкаЗапасовПродукция.СерийныеНомера ПОДОБНО ""СП-%""
	|				ИЛИ алк_СборкаЗапасовПродукция.СерийныеНомера ПОДОБНО ""МС-%""
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Распил)
	|		КОГДА алк_СборкаЗапасовПродукция.СерийныеНомера ПОДОБНО ""НЗ-%""
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	|	КОНЕЦ КАК Операция
	|ПОМЕСТИТЬ ВТ_Приход
	|ИЗ
	|	Документ.алк_СборкаЗапасов.Продукция КАК алк_СборкаЗапасовПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_СборкаЗапасов.СерийныеНомераПродукция КАК алк_СборкаЗапасовСерийныеНомераПродукция
	|		ПО алк_СборкаЗапасовПродукция.КлючСвязи = алк_СборкаЗапасовСерийныеНомераПродукция.КлючСвязи
	|			И алк_СборкаЗапасовПродукция.Ссылка = алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка
	|ГДЕ
	|	алк_СборкаЗапасовПродукция.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_СборкаЗапасовЗапасы.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано),
	|	алк_СборкаЗапасовЗапасы.Номенклатура,
	|	NULL,
	|	алк_СборкаЗапасовЗапасы.Сертификат,
	|	алк_СборкаЗапасовЗапасы.Характеристика,
	|	алк_СборкаЗапасовЗапасы.Количество,
	|	алк_СборкаЗапасовЗапасы.Объем,
	|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Распил)
	|ИЗ
	|	Документ.алк_СборкаЗапасов.Запасы КАК алк_СборкаЗапасовЗапасы
	|ГДЕ
	|	алк_СборкаЗапасовЗапасы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_СборкаЗапасовОтходы.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано),
	|	алк_СборкаЗапасовОтходы.Номенклатура,
	|	NULL,
	|	алк_СборкаЗапасовОтходы.Сертификат,
	|	алк_СборкаЗапасовОтходы.Характеристика,
	|	NULL,
	|	алк_СборкаЗапасовОтходы.Объем,
	|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Списание)
	|ИЗ
	|	Документ.алк_СборкаЗапасов.Отходы КАК алк_СборкаЗапасовОтходы
	|ГДЕ
	|	алк_СборкаЗапасовОтходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_СборкаЗапасов.Дата КАК Период,
	|	ВТ_Приход.ВидДвиженияПроизводства КАК ВидДвиженияПроизводства,
	|	алк_СборкаЗапасов.ДатаСмены КАК ДатаСмены,
	|	ВТ_Приход.Номенклатура КАК Номенклатура,
	|	алк_СборкаЗапасов.Организация КАК Организация,
	|	ВТ_Приход.СерийныйНомер КАК СерийныйНомер,
	|	ВТ_Приход.Сертификат КАК Сертификат,
	|	ВЫБОР
	|		КОГДА ВТ_Приход.ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)
	|			ТОГДА алк_СборкаЗапасов.СтруктурнаяЕдиницаПродукции
	|		ИНАЧЕ алк_СборкаЗапасов.СтруктурнаяЕдиницаЗапасов
	|	КОНЕЦ КАК Склад,
	|	алк_СборкаЗапасов.Смена КАК Смена,
	|	ВТ_Приход.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ВТ_Приход.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА ВТ_Приход.Количество / 1000
	|		ИНАЧЕ ВТ_Приход.Объем
	|	КОНЕЦ КАК Количество,
	|	ВТ_Приход.Операция КАК Операция,
	|	алк_СборкаЗапасов.Участок
	|ИЗ
	|	ВТ_Приход КАК ВТ_Приход
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_СборкаЗапасов КАК алк_СборкаЗапасов
	|		ПО ВТ_Приход.Ссылка = алк_СборкаЗапасов.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСборкаЗапасов);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоОборот", ТаблицаРезультата);
	
КонецПроцедуры

Процедура СформироватьТаблицуОстаткиЗапасов(ДокументСсылкаСборкаЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый  Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_СборкаЗапасовСерийныеНомераПродукция.СерийныйНомер,
	|	алк_СборкаЗапасовСерийныеНомераПродукция.КлючСвязи
	|ПОМЕСТИТЬ ВТ_Пакеты
	|ИЗ
	|	Документ.алк_СборкаЗапасов.СерийныеНомераПродукция КАК алк_СборкаЗапасовСерийныеНомераПродукция
	|ГДЕ
	|	алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_СборкаЗапасовПродукция.Номенклатура,
	|	алк_СборкаЗапасовПродукция.Характеристика,
	|	алк_СборкаЗапасовПродукция.Количество,
	|	алк_СборкаЗапасовПродукция.КлючСвязи,
	|	алк_СборкаЗапасовПродукция.Сертификат,
	|	алк_СборкаЗапасовПродукция.Объем,
	|	алк_СборкаЗапасовПродукция.Ссылка.Дата,
	|	алк_СборкаЗапасовПродукция.Ссылка.Организация,
	|	алк_СборкаЗапасовПродукция.Ссылка.СтруктурнаяЕдиницаПродукции,
	|	алк_СборкаЗапасовПродукция.Ссылка.ЯчейкаПродукции,
	|	алк_СборкаЗапасовПродукция.Ссылка.Направление
	|ПОМЕСТИТЬ ВТ_Продукция
	|ИЗ
	|	Документ.алк_СборкаЗапасов.Продукция КАК алк_СборкаЗапасовПродукция
	|ГДЕ
	|	алк_СборкаЗапасовПродукция.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Продукция.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВТ_Продукция.СтруктурнаяЕдиницаПродукции КАК СтруктурнаяЕдиница,
	|	ВТ_Продукция.ЯчейкаПродукции КАК Штабель,
	|	ВТ_Продукция.Организация КАК Организация,
	|	ВТ_Продукция.Номенклатура КАК Номенклатура,
	|	ВТ_Продукция.Характеристика КАК Характеристика,
	|	ВТ_Продукция.Сертификат КАК Сертификат,
	|	ВТ_Пакеты.СерийныйНомер КАК СерийныйНомер,
	|	ВЫБОР
	|		КОГДА ВТ_Продукция.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА ВТ_Продукция.Количество / 1000
	|		ИНАЧЕ ВТ_Продукция.Объем
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	ВТ_Продукция КАК ВТ_Продукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Пакеты КАК ВТ_Пакеты
	|		ПО ВТ_Продукция.КлючСвязи = ВТ_Пакеты.КлючСвязи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_СборкаЗапасовЗапасы.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	алк_СборкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаЗапасов,
	|	алк_СборкаЗапасовЗапасы.Ссылка.ЯчейкаЗапасов,
	|	алк_СборкаЗапасовЗапасы.Ссылка.Организация,
	|	алк_СборкаЗапасовЗапасы.Номенклатура,
	|	алк_СборкаЗапасовЗапасы.Характеристика,
	|	алк_СборкаЗапасовЗапасы.Сертификат,
	|	NULL,
	|	алк_СборкаЗапасовЗапасы.Объем
	|ИЗ
	|	Документ.алк_СборкаЗапасов.Запасы КАК алк_СборкаЗапасовЗапасы
	|ГДЕ
	|	алк_СборкаЗапасовЗапасы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_СборкаЗапасовОтходы.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	алк_СборкаЗапасовОтходы.Ссылка.СтруктурнаяЕдиницаПродукции,
	|	алк_СборкаЗапасовОтходы.Ссылка.ЯчейкаПродукции,
	|	алк_СборкаЗапасовОтходы.Ссылка.Организация,
	|	алк_СборкаЗапасовОтходы.Номенклатура,
	|	алк_СборкаЗапасовОтходы.Характеристика,
	|	алк_СборкаЗапасовОтходы.Сертификат,
	|	NULL,
	|	алк_СборкаЗапасовОтходы.Объем
	|ИЗ
	|	Документ.алк_СборкаЗапасов.Отходы КАК алк_СборкаЗапасовОтходы
	|ГДЕ
	|	алк_СборкаЗапасовОтходы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСборкаЗапасов);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", ТаблицаРезультата);
	
КонецПроцедуры

#КонецОбласти 

#Область ИнтерфейсПечати

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры
// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

#КонецОбласти
